** star 1
#+BEGIN_SRC python :results output
sum = 0
for line in open("01.txt", "r"):
    sum += int(line)
print(sum)
#+END_SRC

#+RESULTS:
: 454

** star 2
#+BEGIN_SRC python :results output
def f(lines):
  seens = set()
  sum = 0
  while True:
    for line in lines:
      seens.add(sum)
      sum += int(line)
      if sum in seens:
        return sum

assert f(["+1", "-1"]) is 0
assert f(["+3", "+3", "+4", "-2", "-4"]) is 10

print(f(list(open("01.txt", "r"))))
#+END_SRC

#+RESULTS:
: 566

** part 1
#+BEGIN_SRC python :results output
  def f(lines):
    twos = 0
    threes = 0
    for line in lines:
      seenLetters = {}
      for char in line:
        seenLetters[char] = seenLetters.get(char, 0) + 1

      if 2 in seenLetters.values():
        twos = twos + 1
      if 3 in seenLetters.values():
        threes = threes + 1
    return twos * threes

  assert f(["abcdef", "bababc", "abbcde", "abcccd", "aabcdd", "abcdee", "ababab"]) == 12

  print(f(list(open("02.txt", "r"))))
#+END_SRC

#+RESULTS:
: 6150

** part 1 B
#+BEGIN_SRC python :results output
  from collections import Counter
  def f(lines):
    twos = 0
    threes = 0
    for line in lines:
      counter = Counter(line)
      if 2 in counter.values():
        twos = twos + 1
      if 3 in counter.values():
        threes = threes + 1
    return twos * threes

  assert f(["abcdef", "bababc", "abbcde", "abcccd", "aabcdd", "abcdee", "ababab"]) == 12

  print(f(list(open("02.txt"))))
#+END_SRC

#+RESULTS:
: 6150


** part 2
#+BEGIN_SRC python :results output
def f(lines):
  sortedLines = sorted(lines)
  for i in range(1, len(sortedLines)):
    a = sortedLines[i-1]
    b = sortedLines[i]
    diffs = 0;
    diff = 0;
    for j in range(max(len(a), len(b))):
      if a[j] != b[j]:
        diffs += 1
        diff = j
    if diffs == 1:
      return a[:diff] + a[diff+1:]


assert f(["abcde", "fghij", "klmno", "pqrst", "fguij", "axcye", "wvxyz"]) == "fgij"

print(f(list(open("02.txt", "r"))))
#+END_SRC

#+RESULTS:
: rteotyxzbodglnpkudawhijsc
: 

** part 2 B
#+BEGIN_SRC python :results output
from collections import Counter
def f(lines):
  sortedLines = sorted(lines)
  for a, b in zip(sorted(lines), sorted(lines)[1:]):
    diffs = map(lambda (a,b): a != b, zip(a, b))
    if Counter(diffs)[True] == 1:
      diff = diffs.index(1)
      return a[:diff] + a[diff+1:]

assert f(["abcde", "fghij", "klmno", "pqrst", "fguij", "axcye", "wvxyz"]) == "fgij"

print(f(list(open("02.txt"))))
#+END_SRC

#+RESULTS:
: rteotyxzbodglnpkudawhijsc
: 

** part 1
#+BEGIN_SRC python :results output
import re

def f(lines):
  grid = {}
  for line in lines:
    m = re.search("#([0-9]+) @ ([0-9]+),([0-9]+): ([0-9]+)x([0-9]+)", line)
    x = int(m.group(2))
    y = int(m.group(3))
    w = int(m.group(4))
    h = int(m.group(5))
    for xx in range(x, x+w):
      for yy in range(y, y+h):
        key = str((xx, yy))
        grid[key] = grid.get(key, 0) + 1
  return len([c for c in grid.values() if c >= 2])

assert f(["#1 @ 1,3: 4x4", "#2 @ 3,1: 4x4", "#3 @ 5,5: 2x2"]) == 4
print(f(list(open("03.txt"))))
#+END_SRC

#+RESULTS:
: 101196

** part 2
#+BEGIN_SRC python :results output
  import re

  def liner(line):
    m = re.search("#([0-9]+) @ ([0-9]+),([0-9]+): ([0-9]+)x([0-9]+)", line)
    return {"id": int(m.group(1)), \
            "x": int(m.group(2)), \
            "y": int(m.group(3)), \
            "w": int(m.group(4)), \
            "h": int(m.group(5))}

  def f(lines):
    grid = {}
    for line in lines:
      l = liner(line)
      for x in range(l["x"], l["x"]+l["w"]):
        for y in range(l["y"], l["y"]+l["h"]):
          key = str((x, y))
          grid[key] = grid.get(key, 0) + 1

    for line in lines:
      l = liner(line)
      keys = [str((x, y)) for x in range(l["x"], l["x"]+l["w"]) 
                          for y in range(l["y"], l["y"]+l["h"])]
      if len([grid[key] for key in keys if grid[key] >= 2]) == 0:
        return l["id"]
    return None

  assert f(["#1 @ 1,3: 4x4", "#2 @ 3,1: 4x4", "#3 @ 5,5: 2x2"]) == 3
  print(f(list(open("03.txt"))))
#+END_SRC

#+RESULTS:
: 243

** part 2 B
#+BEGIN_SRC python :results output
  import re
  from collections import defaultdict

  def f(lines):
    grid = defaultdict()
    datas = [map(int, re.findall("[0-9]+", line)) for line in lines]
    for (id, x, y, w, h) in datas:
      for xx in xrange(x, x+w):
        for yy in xrange(y, y+h):
          key = (xx, yy)
          grid[key] = grid.get(key, 0) + 1

    for (id, x, y, w, h) in datas:
      keys = [(xx, yy) for xx in xrange(x, x+w) 
                       for yy in xrange(y, y+h)]
      if len([grid[key] for key in keys if grid[key] >= 2]) == 0:
        return id
    return None

  assert f(["#1 @ 1,3: 4x4", "#2 @ 3,1: 4x4", "#3 @ 5,5: 2x2"]) == 3
  print(f(list(open("03.txt"))))
#+END_SRC

#+RESULTS:
: 243
** part 1
#+BEGIN_SRC python :results output
import re
def f(lines):
  guard = {}
  id = None
  start = -1
  end = -1
  for line in sorted(lines):
    if line.strip().endswith("shift"):
      id = int(re.search('[0-9]+', line[26:]).group())
    elif line.strip().endswith("asleep"):
      start = int(line[15:17])
    else:
      sleeps = guard.get(id, {});
      end = int(line[15:17])
      for min in xrange(start, end):
        sleeps[min] = sleeps.get(min, 0) + 1
      guard[id] = sleeps
  id, sleeps = max(guard.items(), key=lambda g: sum(g[1].values()))
  m = max(sleeps.items(), key=lambda m: m[1])[0]
  return id * m

assert f([
"[1518-11-01 00:00] Guard #10 begins shift",
"[1518-11-01 00:05] falls asleep",
"[1518-11-01 00:25] wakes up",
"[1518-11-01 00:30] falls asleep",
"[1518-11-01 00:55] wakes up",
"[1518-11-01 23:58] Guard #99 begins shift",
"[1518-11-02 00:40] falls asleep",
"[1518-11-02 00:50] wakes up",
"[1518-11-03 00:05] Guard #10 begins shift",
"[1518-11-03 00:24] falls asleep",
"[1518-11-03 00:29] wakes up",
"[1518-11-04 00:02] Guard #99 begins shift",
"[1518-11-04 00:36] falls asleep",
"[1518-11-04 00:46] wakes up",
"[1518-11-05 00:03] Guard #99 begins shift",
"[1518-11-05 00:45] falls asleep",
"[1518-11-05 00:55] wakes up"]) == 240
print(f(list(open("04.txt"))))
#+END_SRC

#+RESULTS:
: 95199

 - guess: 39

** part 2
#+BEGIN_SRC python :results output
import re
def f(lines):
  guard = {}
  id = None
  start = -1
  end = -1
  for line in sorted(lines):
    if line.strip().endswith("shift"):
      id = int(re.search('[0-9]+', line[26:]).group())
    elif line.strip().endswith("asleep"):
      start = int(line[15:17])
    else:
      sleeps = guard.get(id, {});
      end = int(line[15:17])
      for min in xrange(start, end):
        sleeps[min] = sleeps.get(min, 0) + 1
      guard[id] = sleeps
  id, sleeps = max(guard.items(), key=lambda g: max(g[1].values()))
  m = max(sleeps.items(), key=lambda m: m[1])[0]
  return id * m

assert f([
"[1518-11-01 00:00] Guard #10 begins shift",
"[1518-11-01 00:05] falls asleep",
"[1518-11-01 00:25] wakes up",
"[1518-11-01 00:30] falls asleep",
"[1518-11-01 00:55] wakes up",
"[1518-11-01 23:58] Guard #99 begins shift",
"[1518-11-02 00:40] falls asleep",
"[1518-11-02 00:50] wakes up",
"[1518-11-03 00:05] Guard #10 begins shift",
"[1518-11-03 00:24] falls asleep",
"[1518-11-03 00:29] wakes up",
"[1518-11-04 00:02] Guard #99 begins shift",
"[1518-11-04 00:36] falls asleep",
"[1518-11-04 00:46] wakes up",
"[1518-11-05 00:03] Guard #99 begins shift",
"[1518-11-05 00:45] falls asleep",
"[1518-11-05 00:55] wakes up"]) == 4455
print(f(list(open("04.txt"))))
#+END_SRC

#+RESULTS:
: 7887

 - guess: 39
   
** part 2 B
#+BEGIN_SRC python :results output
import re
def f(lines):
  guard = {}
  id = None
  start = -1
  end = -1
  for line in sorted(lines):
    numbers = [ int(n) for n in re.findall("[0-9]+", line) ]
    if "shift" in line:
      id = numbers[5]
    elif "asleep" in line:
      start = numbers[4]
    else:
      sleeps = guard.get(id, {});
      end = numbers[4]
      for min in xrange(start, end):
        sleeps[min] = sleeps.get(min, 0) + 1
      guard[id] = sleeps
  id, sleeps = max(guard.items(), key=lambda g: max(g[1].values()))
  m = max(sleeps.items(), key=lambda m: m[1])[0]
  return id * m

assert f([
"[1518-11-01 00:00] Guard #10 begins shift",
"[1518-11-01 00:05] falls asleep",
"[1518-11-01 00:25] wakes up",
"[1518-11-01 00:30] falls asleep",
"[1518-11-01 00:55] wakes up",
"[1518-11-01 23:58] Guard #99 begins shift",
"[1518-11-02 00:40] falls asleep",
"[1518-11-02 00:50] wakes up",
"[1518-11-03 00:05] Guard #10 begins shift",
"[1518-11-03 00:24] falls asleep",
"[1518-11-03 00:29] wakes up",
"[1518-11-04 00:02] Guard #99 begins shift",
"[1518-11-04 00:36] falls asleep",
"[1518-11-04 00:46] wakes up",
"[1518-11-05 00:03] Guard #99 begins shift",
"[1518-11-05 00:45] falls asleep",
"[1518-11-05 00:55] wakes up"]) == 4455
print(f(list(open("04.txt"))))
#+END_SRC

#+RESULTS:
: 7887

 - guess: 39
   
